{
    "error": {
        "title": "¡Ups, ha ocurrido un error!",
        "403": {
            "title": "Error 403",
            "detail": "Lo sentimos, no tiene permisos para acceder a la página."
        },
        "accessDenied": "Lo sentimos, no tiene permisos para acceder a la página.",
        "404": {
            "title": "Error 404",
            "detail": "Lo sentimos, la página que busca no existe."
        },
        "blockedUser": {
            "title": "Error de usuario",
            "detail": "Lo sentimos, el usuario con el que intenta acceder está bloqueado."
        },
        "nonExistingUser": {
            "title": "Error de usuario",
            "detail": "Lo sentimos, el usuario con el que intenta acceder no se ha dado de alta."
        },
        "internalServerError": "Error interno del servidor",
        "field": {
            "value": "El valor de uno de los campos es incorrecto",
            "validation": "Existen errores de validación en los siguientes campos:",
            "constraint": "{{fieldName}}, {{causeMessage}}"
        },
        "server.not.reachable": "Servidor no accesible",
        "url.not.found": "No encontrado",
        "NotNull": "¡El campo {{0}} no puede estar vacío!",
        "Size": "¡El campo {{0}} no cumple con los requisitos de tamaño mínimo/máximo!",
        "usuario-existe": "El nombre de usuario o correo electrónico introducido ya está siendo usado",
        "id-existe": "Un nuevo {{0}} no puede tener previamente un ID",
        "entidad-no-encontrada": "Resultado de {{0}} no encontrado",
        "entity": {
            "deleted": "El resultado de {{0}} se encuentra eliminado"
        },
        "rol": {
            "users-has-role": "No se puede eliminar un rol que está asignado a algunos usuarios"
        },
        "query-no-soportada": "Parámetro de búsqueda {{0}} no soportado",
        "etl": {
            "currentlyDeleted": "Esta ETL se encuentra actualmente eliminada",
            "currentlyNotDeleted": "Esta ETL se encuentra actualmente activa",
            "cronExpressionNotValid": "La expresión cron {{0}} no es válida",
            "scheduleError": "Ha ocurrido un error en la creación de la planificación de ejecución de la ETL",
            "unscheduleError": "Ha ocurrido un error en el borrado de la planificación de ejecución de la ETL",
            "codeExists": "Ya existe otra ETL con el mismo código",
            "cloneRepository": "Ha ocurrido un error clonando el repositorio",
            "replacingRepository": "Ha ocurrido un error reemplazando el repositorio",
            "accessDenied": "Lo sentimos, no tiene permisos suficientes para realizar la operación"
        },
        "health": {
            "serviceName": {
                "isBlank": "El nombre del servicio no puede estar vacío"
            },
            "endpoint": {
                "isBlank": "La URL no puede estar vacía"
            }
        },
        "parameter": {
            "key": {
                "isDuplicated": "Ya existe un parámetro con la misma clave",
                "isDuplicatedInGlobalParameter": "Ya existe un parámetro global con la misma clave",
                "isBlank": "La clave del parámetro no puede estar vacía"
            },
            "value": {
                "isBlank": "El valor del parámetro no puede estar vacío"
            },
            "edit": "Ha ocurrido un error en la edición del parámetro",
            "global": {
                "key": {
                    "isDuplicated": "Ya existe un parámetro en una con la misma clave en la ETL: <strong> {{0}} </strong> "
                }
            }
        },
        "organism": {
            "key": {
                "isDuplicated": "Ya existe un un organismo con el mismo nombre",
                "notDeleted": "El organismo no puede ser eliminado debido a que existen etls configuradas con dicho organismo",
                "notDeletedByUser": "El organismo no puede ser eliminado debido a que existe algún usuario con el organimo asignado a alguno de sus roles"
            },
            "name": {
                "isBlank": "El nombre del organismo no puede estar vacío"
            },
            "description": {
                "limitExceed": "El campo descripción solamente puede tener 255 caracteres."
            }
        },
        "quartz": {
            "jobExecutionError": "Ha ocurrido un error en la ejecución planificada de la ETL con código {{0}}"
        },
        "userRolOrganismoNotEmpty": "Un usuario debe tener al menos configurado un organismo, para al menos un rol",
        "userRolOrganismoJustOnce": "Un usuario no puede tener configurado un mismo organismo en más de un rol",
        "execution": {
            "credentials": "Se produjo un error con las credenciales del repositorio git",
            "uri": "Ha ocurrido un error con la URI del repositorio indicado en la etl {{0}}",
            "pull": "Ha ocurrido un error durante la actualización del repositorio",
            "unkwown": "Se ha producido un error inesperado mientras actualizaba el repositorio {{0}}"
        }
    }
}
